import { memo, useEffect } from "react";

import img from "../../assets/img/11.jpg";
import Footer from "../../components/Footer/Footer";
import Header from "../../components/Header/Header";

function AboutUs() {
        //   وقتی وارد صفحه محصول می‌شی، اگر صفحه پایین باشه، اسلایدر دیده نمی‌شه
        useEffect(() => {
            window.scrollTo(0, 0);
          }, []);
  return (
    <>
<Header >درباره ما</Header>
      <div className="AboutUs p-2">
        <div className="relative w-[100%] ">
          <img src={img} alt="" className="" />
          <h2 className="absolute text-[170%] font-extrabold top-[35%] w-[100%] text-center ">
            درباره ما
          </h2>
        </div>
        <h3 className="text-[130%] p-3 pt-4 w-[100%] text-center  font-bold">خوش اومدی به فروشگاه شقایق 💙
        </h3>
     <p className="px-2">
ما اینجا دور هم جمع شدیم تا خرید پوشاک زنونه رو برات ساده‌تر، سریع‌تر و مهم‌تر از همه، لذت‌بخش‌تر کنیم.
<br />
از همون روز اول، هدفمون فقط فروش لباس نبود! می‌خواستیم تجربه‌ای بسازیم که حس خوب بده
 مثل وقتی لباسی که دوست داری رو پیدا می‌کنی و با ذوق می‌پوشیش.
<br />
باور داریم که لباس خوب، فقط ظاهر قشنگ نیست؛ باید راحت، باکیفیت و موندگار باشه.
<br />
 برای همین با دقت سراغ انتخاب طرح‌ها، پارچه‌ها و دوخت می‌ریم تا محصولی بهت بدیم که همون‌قدر که زیباست، کاربردی هم باشه, با قیمتی منصفانه و بدون اضافه‌گویی.
<br />
<br />
تیم ما یه گروه پرانرژیه؛ از طراحی و تولید محتوا گرفته تا پشتیبانی، انبار و بسته‌بندی، همه با عشق کار می‌کنن تا سفارشت دقیق، شیک و به‌موقع به دستت برسه.
<br/>
ما به جزئیات اهمیت می‌دیم، چون می‌دونیم همین چیزهای کوچیکه که باعث می‌شه یه خرید معمولی تبدیل به یه تجربه‌ی خوب بشه.
</p>


<p className="text-center text-[110%] font-[600] w-[100%] py-2">اعتماد تو بزرگ‌ترین سرمایه‌ی ماست.
</p>

<p className="text-center">
ما هر روز با انگیزه‌ی بیشتر تلاش می‌کنیم تا بهتر بشیم
<br />
 چون می‌خوایم همیشه انتخاب اولت باشیم!
<br />
نه فقط برای خرید، بلکه برای حس خوب همراهی💙
     </p>
      </div>
      <Footer></Footer>
    </>
  );
}
export default memo(AboutUs);
